app/controllers/books_controller.rb

SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aa"], ["body", "aaaaa"], ["user_id", 1], ["created_at", "2020-07-23 09:35:44.466819"], ["updated_at", "2020-07-23 09:35:44.466819"]]
---
	def create
		@books = Book.all
		@book = Book.new(book_params)
		@user = current_user
		@book.user_id = current_user.id
		if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@books = Book.new
		@book = Book.find(params[:id])