app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def edit
		@user = current_user
		@book = Book.new
		@users = User.find(params[:id])